app/Models/UsersModel.php

SELECT `wish`.`wish`
FROM `wish`
WHERE `id_usuario` = '1'
SELECT `users`.`usuario`, `users`.`avatar`, `wish`.`wish`
FROM `users`
JOIN `wish` ON `users`.`id_user` = `wish`.`id_usuario`
WHERE `users`.`id_user` NOT IN ('1')
---
    public function getUsersData($id)
    {
        $builder = $this->db->table('users');
        $builder->select('users.usuario, users.avatar, wish.wish');
        $builder->join('wish', 'users.id_user = wish.id_usuario');
        $builder->whereNotIn('users.id_user', [$id]);
        return $builder->get()->getResultArray();

SELECT `wish`
FROM `wish`
WHERE `id_usuario` = '1'
---
    public function checkWish($data)
    {
        $builder = $this->db->table('wish');
        $builder->select('wish');
        $builder->where('id_usuario', $data['id']);
        if (count($builder->get()->getResultArray()) == 0) {

UPDATE `wish` SET `wish` = 'un iphone 13\ncabello'
WHERE `id_usuario` = '1'
---
    public function updateWish($data)
    {
        $builder = $this->db->table('wish');
        $update = [
            'wish' => $data['wish']
        ];
        $builder->where('id_usuario', $data['id']);
        $builder->update($update);

INSERT INTO `wish` (`wish`, `id_usuario`) VALUES ('un iphone 13', '1')
---
    public function newWish($data)
    {
        $builder = $this->db->table('wish');
        $insert = [
            'wish' => $data['wish'],
            'id_usuario' => $data['id']
        ];
        $builder->insert($insert);